In [96]:
import pandas as pd

In [97]:
##Q1
## pd.DataFrame(), df.describe(), df.head(), df.dtypes, df.to_csv()

data={'Name':['Alice','Bob','Claire'],'Age':[25,30,27],'Gender':['Female','Male','Female']}

#pd.DataFrame: converts given data to dataframe
df=pd.DataFrame(data)
print(df)

#df.describe(): gives the basic information about integer datatype from Dataframe like count,mean,min,max,etc
print(df.describe())

##df.head(): Gives top n data from dataframe
print(df.head(2))

#df.dtypes: gives the datatype of each column in dataframe
print(df.dtypes)

#df.to_csv(): converts the dataframe to csv formats and saves locally.
df.to_csv('MyData.csv')

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female
             Age
count   3.000000
mean   27.333333
std     2.516611
min    25.000000
25%    26.000000
50%    27.000000
75%    28.500000
max    30.000000
    Name  Age  Gender
0  Alice   25  Female
1    Bob   30    Male
Name      object
Age        int64
Gender    object
dtype: object

In [98]:
##Q2

df2=pd.DataFrame(data, index=['A','B','C'])
print(df2)
##reindex
n=0
df2.reindex([1,3,5])

     Name  Age  Gender
A   Alice   25  Female
B     Bob   30    Male
C  Claire   27  Female

  Name  Age Gender
1  NaN  NaN    NaN
3  NaN  NaN    NaN
5  NaN  NaN    NaN

In [99]:
##Q3

data3={'Values':[10, 20, 30, 40, 50]}

df3=pd.DataFrame(data3)
print(df3[:3].sum())

Values    60
dtype: int64

In [100]:
##Q4

df=pd.DataFrame({'Text': ['Shorter code is typically easier for others to read',
'Shorter code is typically easier to maintain than longer code',
'Extra lines of code introduce additional points of failure',
'An input value greater than 100 causes the triggering of logging']})

df['Word_Count']=df["Text"].apply(lambda n: len(n.split()))
df['Word_Count']

0     9
1    10
2     9
3    11
Name: Word_Count, dtype: int64

**Q5**

The df.size() is a function used on dataframe to return the size of dataframe or elements present in the dataframe     
while      
The df.shape() is used to return the dimensions of a particular dataframe in the form of rowsxcolumns.

**Q6**

We use the pd.read_excel() method to read an excel file.

In [101]:
##Q7

df=pd.DataFrame({'Email':['mlewan@yahoo.com',
'empathy@verizon.net',
'hling@mac.com',
'rwelty@verizon.net',
'william@sbcglobal.net',
'parents@gmail.com']})
df['Username']=df["Email"].apply(lambda n: n.split('@')[0])
df

                   Email Username
0       mlewan@yahoo.com   mlewan
1    empathy@verizon.net  empathy
2          hling@mac.com    hling
3     rwelty@verizon.net   rwelty
4  william@sbcglobal.net  william
5      parents@gmail.com  parents

In [102]:
##Q8

data={'A':[3,8,6,2,9],'B':[5,2,9,3,1],'C':[1,7,4,5,2]}
df1=pd.DataFrame(data)
df1.values
df2=pd.DataFrame(df1[(df1['A']>5)&(df1['B']<10)].values, columns=['A','B','C'])
print(df2)

   A  B  C
0  8  2  7
1  6  9  4
2  9  1  2

In [103]:
##Q9

data3={'Values':[10, 20, 30, 40, 50]}
df3=pd.DataFrame(data3)

print('Mean:',df3.mean()[0], '\n','Median:',df3.median()[0],'\n','Std:',df3.std()[0])

Mean: 30.0
 Median: 30.0
 Std: 15.811388300841896

In [135]:
##Q10

import random
dates=pd.date_range(start=pd.to_datetime("1/1/2023"), end=date.today(), periods=28).to_pydatetime().tolist()
data2={"Sales": random.sample(range(100,200),28), "Dates": dates }
Sales_df=pd.DataFrame(data2)
Sales_df.head()
Sales_df['Sales'].rolling(window=7).mean()

0            NaN
1            NaN
2            NaN
3            NaN
4            NaN
5            NaN
6     137.714286
7     142.142857
8     134.000000
9     133.857143
10    134.142857
11    133.857143
12    133.714286
13    142.428571
14    140.571429
15    139.285714
16    141.000000
17    146.000000
18    140.142857
19    148.285714
20    146.428571
21    155.000000
22    160.142857
23    158.857143
24    157.714286
25    164.714286
26    161.000000
27    161.714286
Name: Sales, dtype: float64

In [173]:
##Q11

from datetime import date
import calendar
dates=pd.date_range(date.today(), periods=10).to_pydatetime().tolist()
data1={'Dates': dates}
my_data= pd.DataFrame(data1)
my_data['Weekday']= my_data['Dates'].apply(lambda x: calendar.day_name[x.weekday()])
my_data

       Dates    Weekday
0 2023-08-27     Sunday
1 2023-08-28     Monday
2 2023-08-29    Tuesday
3 2023-08-30  Wednesday
4 2023-08-31   Thursday
5 2023-09-01     Friday
6 2023-09-02   Saturday
7 2023-09-03     Sunday
8 2023-09-04     Monday
9 2023-09-05    Tuesday

In [174]:
##Q12

dates_new=pd.date_range(start=pd.to_datetime("1/1/2023"), end=date.today(), periods=35).to_pydatetime().tolist()
dF=pd.DataFrame(dates_new, columns=['Dates'])
start_date = '2023-01-01'
end_date = '2023-01-31'
date_range = pd.date_range(start=start_date, end=end_date)
dF.loc[dF['Dates'].isin(date_range)]

       Dates
0 2023-01-01
1 2023-01-08
2 2023-01-15
3 2023-01-22
4 2023-01-29

**#Q13**

To use the pandas functions, we must first include the pandas library -- import pandas as pd